In [1]:
import Fish_data

In [2]:
f = Fish_data.Fish()

In [3]:
fish_data = f.get_fish_data()
water_data = f.get_water_data()

In [4]:
fish_data.head()

,FishID,Date,TREND,Gear,Species,Sex,Length,Mass,Ktl,Weight,...,parasite,misc 1 text,misc 2 num,misc 3 text,misc 4 num,Site,KFL,Day,Month,Year
0,19710001,1971-03-09 00:00:00,1,GN,LMB,NaN,263,250.0,1.37,0.0,...,NaN,NaN,NaN,NaN,NaN,RN,0.0,9,3,1971
1,19710002,1971-03-09 00:00:00,1,GN,LMB,NaN,348,700.0,1.66,0.0,...,NaN,NaN,NaN,NaN,NaN,RN,0.0,9,3,1971
2,19710003,1971-03-09 00:00:00,1,GN,LMB,NaN,332,555.0,1.51,0.0,...,NaN,NaN,NaN,NaN,NaN,RN,NaN,9,3,1971
3,19710004,1971-03-09 00:00:00,1,GN,LMB,NaN,350,720.0,1.67,0.0,...,NaN,NaN,NaN,NaN,NaN,RN,NaN,9,3,1971
4,19710005,1971-03-09 00:00:00,1,GN,LMB,NaN,300,455.0,1.68,0.0,...,NaN,NaN,NaN,NaN,NaN,RN,NaN,9,3,1971

,FishID,Date,TREND,Gear,Species,Sex,Length,Mass,Ktl,Weight,...,parasite,misc 1 text,misc 2 num,misc 3 text,misc 4 num,Site,KFL,Day,Month,Year
0,19710001,1971-03-09 00:00:00,1,GN,LMB,NaN,263,250.0,1.37,0.0,...,NaN,NaN,NaN,NaN,NaN,RN,0.0,9,3,1971
1,19710002,1971-03-09 00:00:00,1,GN,LMB,NaN,348,700.0,1.66,0.0,...,NaN,NaN,NaN,NaN,NaN,RN,0.0,9,3,1971
2,19710003,1971-03-09 00:00:00,1,GN,LMB,NaN,332,555.0,1.51,0.0,...,NaN,NaN,NaN,NaN,NaN,RN,NaN,9,3,1971
3,19710004,1971-03-09 00:00:00,1,GN,LMB,NaN,350,720.0,1.67,0.0,...,NaN,NaN,NaN,NaN,NaN,RN,NaN,9,3,1971
4,19710005,1971-03-09 00:00:00,1,GN,LMB,NaN,300,455.0,1.68,0.0,...,NaN,NaN,NaN,NaN,NaN,RN,NaN,9,3,1971

In [5]:
fish_data.columns

Index(['FishID', 'Date', 'TREND', 'Gear', 'Species', 'Sex', 'Length', 'Mass',
       'Ktl', 'Weight', 'Maturity', 'Age structure', 'stomach', 'gonads',
       'fat_index', 'parasite', 'misc 1 text', 'misc 2 num', 'misc 3 text',
       'misc 4 num', 'Site', 'KFL', 'Day', 'Month', 'Year'],
      dtype='object')

Index(['FishID', 'Date', 'TREND', 'Gear', 'Species', 'Sex', 'Length', 'Mass',
       'Ktl', 'Weight', 'Maturity', 'Age structure', 'stomach', 'gonads',
       'fat_index', 'parasite', 'misc 1 text', 'misc 2 num', 'misc 3 text',
       'misc 4 num', 'Site', 'KFL', 'Day', 'Month', 'Year'],
      dtype='object')

In [6]:
water_data.head()

,Unnamed: 0,DATE MEASURED,ELEVATION,CONTENT,INFLOW,OUTFLOW,HIGH TEMP,LOW TEMP,WATER,MONTH,DAY,YEAR
0,1,"Thu, Mar 14, 1963",NaN,NaN,4748,1300,58.0,28.0,NaN,3,14,1963
1,2,"Fri, Mar 15, 1963",NaN,NaN,4730,1260,58.0,26.0,NaN,3,15,1963
2,3,"Sat, Mar 16, 1963",NaN,NaN,4793,1220,47.0,29.0,NaN,3,16,1963
3,4,"Sun, Mar 17, 1963",NaN,NaN,4748,1260,50.0,36.0,NaN,3,17,1963
4,5,"Mon, Mar 18, 1963",NaN,NaN,4532,1210,48.0,32.0,NaN,3,18,1963

,Unnamed: 0,DATE MEASURED,ELEVATION,CONTENT,INFLOW,OUTFLOW,HIGH TEMP,LOW TEMP,WATER,MONTH,DAY,YEAR
0,1,"Thu, Mar 14, 1963",NaN,NaN,4748,1300,58.0,28.0,NaN,3,14,1963
1,2,"Fri, Mar 15, 1963",NaN,NaN,4730,1260,58.0,26.0,NaN,3,15,1963
2,3,"Sat, Mar 16, 1963",NaN,NaN,4793,1220,47.0,29.0,NaN,3,16,1963
3,4,"Sun, Mar 17, 1963",NaN,NaN,4748,1260,50.0,36.0,NaN,3,17,1963
4,5,"Mon, Mar 18, 1963",NaN,NaN,4532,1210,48.0,32.0,NaN,3,18,1963